## Terraform `services`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>


```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.api-comments.aws_ecs_service.service will be updated in-place
  ~ resource "aws_ecs_service" "service" {
        id                                 = "arn:aws:ecs:us-east-1:685496751393:service/dev/api-comments"
        name                               = "api-comments"
        tags                               = {
            "Name"    = "api-comments.service.dev.desafio"
            "Service" = "api-comments"
        }
      ~ task_definition                    = "api-comments:7" -> (known after apply)
        # (14 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.api-comments.aws_ecs_task_definition.task_definition must be replaced
-/+ resource "aws_ecs_task_definition" "task_definition" {
      ~ arn                      = "arn:aws:ecs:us-east-1:685496751393:task-definition/api-comments:6" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-east-1:685496751393:task-definition/api-comments" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                  ~ dockerLabels     = {
                      + PROMETHEUS_EXPORTER_PATH                                                                     = "/metrics"
                      + PROMETHEUS_EXPORTER_PORT                                                                     = "8000"
                        # (13 unchanged attributes hidden)
                    }
                  - environment      = []
                  ~ image            = "685496751393.dkr.ecr.us-east-1.amazonaws.com/api-comments:017bb53" -> "685496751393.dkr.ecr.us-east-1.amazonaws.com/api-comments:84f7fc2"
                    name             = "api-comments"
                    # (9 unchanged attributes hidden)
                },
            ] # forces replacement
        )
      ~ id                       = "api-comments" -> (known after apply)
      ~ revision                 = 6 -> (known after apply)
        tags                     = {
            "Name"    = "api-comments.task.dev.desafio"
            "Service" = "api-comments"
        }
        # (9 unchanged attributes hidden)
    }

Plan: 1 to add, 1 to change, 1 to destroy.
```

</details>

*Pusher: @sidneiweber, Action: `pull_request`*